tap "hamed-elfayome/claude-usage"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Emacs dependency management
brew "cask"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Self-improving AI agent that creates skills from experience
brew "hermes-agent"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk@21"
# Cross-shell prompt for astronauts
brew "starship"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application uninstaller
cask "appcleaner"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Native macOS menu bar app for monitoring Claude AI usage limits
cask "hamed-elfayome/claude-usage/claude-usage-tracker"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# AI-powered translator
cask "deepl"
cask "font-d2coding-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Software for Logitech devices
cask "logi-options+"
# App to write, plan, collaborate, and get organised
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Daily planner and calendar
cask "sunsama"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# To-do & task list manager
cask "ticktick"
# To-do list
cask "todoist-app"
mas "Goodnotes", id: 1444383602
mas "PhotoScape X", id: 929507092
mas "Pixea", id: 1507782672
mas "Things", id: 904280696
mas "카카오톡", id: 869223134
