# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Emacs dependency management
brew "cask"
# Mac App Store command-line interface
brew "mas"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# UNIX shell (command interpreter)
brew "zsh"
# Application uninstaller
cask "appcleaner"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# AI-powered translator
cask "deepl"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Software for Logitech devices
cask "logi-options+"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
mas "Goodnotes", id: 1444383602
mas "PhotoScape X", id: 929507092
mas "Things", id: 904280696
mas "카카오톡", id: 869223134
